package problemssolutions.problems;

public class ChessStoreProblem {
    public static void main(String[] args) {
        //сохранить шахматную партию в как можно меньшем обьеме
        //32 байта - Аронов

        //2 ладьи(1s) 2 коня(1s) 2 слона(1s) 1 короля 1 ферзя(1s) 8 пешек(4s) Х 2 набора = 6 разных типов фигур + 1 на цвет = 4 бит
        //64 клетки [0-63] = 6 бит
        // 10/16 бит = 2 байта на фигуру ->
        //0000 00[00 0][0]color[00 0000] резерв под клетку

        // 43 44 54 34 43 54 65 76 54 43 43 54 65 76 54 43 -> 16*2
    }
}
